Indulge125/stm32-ota-bootloader/3-IO模拟SPI驱动W25Q64/Hardware/W25Q64.c
#include "stm32f10x.h"                  // Device header
#include "MySPI.h"
#include "W25Q64_Ins.h"


void W25Q64_Init(void)
{
	MySPI_Init();
}


void W25Q64_ReadID(uint8_t *MID, uint16_t *DID)//输出8位厂商ID和16位设备ID
{
	MySPI_Start();
	MySPI_SwapByte(W25Q64_CMD_READ_ID);
	*MID = MySPI_SwapByte(W25Q64_DUMMY_BYTE);
	*DID = MySPI_SwapByte(W25Q64_DUMMY_BYTE);
	*DID <<= 8;
	*DID |= MySPI_SwapByte(W25Q64_DUMMY_BYTE);
	MySPI_Stop();
}

void W25Q64_WriteEnable(void)
{
	MySPI_Start();
	MySPI_SwapByte(W25Q64_CMD_WRITE_ENABLE);
	MySPI_Stop();
}

void W25Q64_WaitBusy(void)
{
	uint32_t Timeout;
	MySPI_Start();
	MySPI_SwapByte(W25Q64_CMD_READ_STATUS_REG1);
	Timeout = 100000;
	while((MySPI_SwapByte(W25Q64_DUMMY_BYTE) & 0x01) == 0x01)
	{
		Timeout --;
		if(Timeout == 0)
		{
			break;
		}
	}
	MySPI_Stop();
}

void W25Q64_PageProgram(uint32_t PageNum, uint8_t *DataArray, uint16_t Count)
{
	uint16_t i;
	
	W25Q64_WriteEnable();
	
	MySPI_Start();
	MySPI_SwapByte(W25Q64_CMD_PAGE_PROGRAM);
	MySPI_SwapByte(PageNum * 256 >> 16);
	MySPI_SwapByte(PageNum * 256 >> 8);
	MySPI_SwapByte(PageNum * 256);
	for(i = 0; i < Count; i++)
	{
		MySPI_SwapByte(DataArray[i]);
	}
	
	MySPI_Stop();
	
	W25Q64_WaitBusy();
}

void W25Q64_SectorErase(uint32_t Address)
{
	W25Q64_WriteEnable();
	
	MySPI_Start();	
	MySPI_SwapByte(W25Q64_CMD_SECTOR_ERASE);
	MySPI_SwapByte(Address >> 16);
	MySPI_SwapByte(Address >> 8);
	MySPI_SwapByte(Address);
	MySPI_Stop();
	W25Q64_WaitBusy();
}

void W25Q64_Erase64K(uint32_t BlockNum)
{
	W25Q64_WriteEnable();
	
	MySPI_Start();	
	MySPI_SwapByte(W25Q64_CMD_BLOCK_ERASE_64KB);
	MySPI_SwapByte(BlockNum * 64 * 1024 >> 16);
	MySPI_SwapByte(BlockNum * 64 * 1024 >> 8);
	MySPI_SwapByte(BlockNum * 64 * 1024);
	MySPI_Stop();
	W25Q64_WaitBusy();
}


void W25Q64_ReadData(uint32_t Address, uint8_t *DataArray, uint32_t Count)
{
	uint32_t i;
	
	MySPI_Start();
	MySPI_SwapByte(W25Q64_CMD_READ_DATA);
	MySPI_SwapByte(Address >> 16);
	MySPI_SwapByte(Address >> 8);
	MySPI_SwapByte(Address);
	
	for(i = 0; i < Count; i++)
	{
		DataArray[i] = MySPI_SwapByte(W25Q64_DUMMY_BYTE);
	}
	MySPI_Stop();
}

